In [1]:
import numpy as np

In [2]:
import pandas as pd

In [3]:
df = pd.read_table("data.txt")

In [4]:
df

  name  score sex
0  Tim     80   M
1  Tom     85   M
2  Kim     70   F
3  Sam     90   M
4  Efe     75   M

In [5]:
df2 = pd.read_table("data2.txt")

In [6]:
df2

    Tom,80,M
0   Tim,85,M
1   Kim,70,M
2  Kate,90,F
3  Alex,75,F

In [7]:
df2 = pd.read_table("data2.txt", sep = ',')

In [8]:
df2

    Tom  80  M
0   Tim  85  M
1   Kim  70  M
2  Kate  90  F
3  Alex  75  F

In [9]:
df = df2

In [11]:
df = pd.read_table("data2.txt", sep =',')

In [24]:
df = pd.read_table('data2.txt',sep=',', header = None, names =['name', 'score', 'sex'], index_col = 'name')

In [25]:
df

      score sex
name
Tom      80   M
Tim      85   M
Kim      70   M
Kate     90   F
Alex     75   F

In [46]:
df = pd.read_table('data3.txt', sep = ',', index_col = ['lesson', 'name'])

In [47]:
df

             one  two
lesson name
Math   Kim    80   85
       Tim    90   70
       Tom    70   95
Stat   Kate   65   90
       Alex   85   80
       Sam    55   70

In [48]:
df2 = df

In [60]:
df = pd.read_table('data4.txt', sep=',', skiprows = (0,2), usecols = (0,1), nrows = 3)

In [61]:
df

   name  score
0   Tim     80
1  Kate     85
2  Alex     70

In [65]:
df4 = pd.read_table('data.txt', sep = '\t')

In [66]:
df4

  name  score sex
0  Tim     80   M
1  Tom     85   M
2  Kim     70   F
3  Sam     90   M
4  Efe     75   M

In [68]:
df4.to_csv('newcsvfile.csv')